{
  "leaderContent1": "Kwame Dzadey Jnr heads the management team as the Chief Executive Officer and holds a certificate in Mechanical Engineering (Hamburg), Certificate in Commercial Salesmanship (London). He also holds a diploma in Sales Management/Marketing (London) and has over 23 years of experience in mining, exploration, and acquisition of mineral properties. He has been the Chief Executive Officer and Chairman since 1985 and also involved in all aspects of precious metals, including bullion dealing, smelting, and refinery. His contacts throughout the mining industry in Ghana and overseas are a great asset to the firm. He will be responsible for project management, the strategic policies and growth of the firm, and implementation of the vision and mission statements of the firm.",
  "values": "Professionalism<br />Integrity <br />Efficiency <br />Environmentally friendly approach",
  "leaderContent2": "Mr. Dewornu is a retired IGP. He is a General Advisor to the Board and Management on all aspects of the company’s operations. He also focuses on the overall security strategies and issues associated with the firm. He was a former Inspector General of Police in Ghana and also a former member of the Council of State.",
  "leaderTitle1": "Chief Executive Officer - Kwame Dzadey Jnr (68 years)",
  "leaderContent3": "Elike Atsu holds a B.Sc. Civil Engineering from the Kwame Nkrumah University of Science and Technology. He is the General Manager and has been with the company for five years, he is responsible for planning, directing, and coordinating the operations of the firm. He is also in charge of managing daily activities, maintaining a smooth flow of work between all departments/sectors, and resolving inter-departmental conflicts. He as well has a Diploma in Management Information Studies.",
  "leaderTitle2": "General Advisor - Christopher Dewornu (75 years)",
  "leaderContent4": "Paul Dzadey is the company secretary. He is a very innovative and experienced Solicitor/Barrister with 14 + years of experience in conveyancing and considerable experience in land litigation. He is very organized, personable, and task-oriented, with a strong ability to communicate efficiently. He holds a Barrister at Law (B.L) and Post Graduate Qualifying Certificate in Law from the Ghana School of Law. He also holds Bachelor of Arts (Hons) in Modern History and Archeology from the University of Ghana Legon. His experiences include working as the Principal Registrar of Accra, Senior Registrar of Lands, Registrar of Lands, and Assistant Registrar of Lands all at the Land Registration Division, Accra under the Lands Commission of Ghana.",
  "leaderTitle3": "General Manager - Elike Atsu (38 years)",
  "leaderTitle4": "Company Secretary - Paul Dzadey (60 years)",
  "vision": "To build a world-className listed mining firm with a chain of large-scale mines across Ghana and West Africa.",
  "mission": "To progressively harness best philosophies, practices, tools, partnerships, and resources to grow the company’s mining and process capability.",
  "leaderPic1": "/img/leadership.png",
  "leaderPic2": "/img/leadership.png",
  "leaderPic3": "/img/leadership.png",
  "leaderPic4": "/img/leadership.png",
  "story": "Bugudon Limited proponents have broad experience in the mining sector with great qualifications and viewpoints. They believe in the wealth-creating capabilities of a well-planned, managed, and operated mining project. Bugudon Limited was founded in 1985 by Kwame Dzadey Jnr, a visionary and season entrepreneur who has great passion for “make things happen”. The dream has and still is to establish a large-scale gold mining operation. After being incorporated, the firm went through the processes of the Minerals Commission to acquire a series of concessions in the Eastern and Western Region of Ghana.\n\nThe company has three (3) large scale concession which it is seeking to work with investors to bring them to the exploitation:\n\n1. Bugudon Gold Mine - Awaham Project\n2. Bugudon 2 Gold Mine - Wamase Project\n3. Wenof Gold Mine – Moseaso Project (under propecting – no proven reserves yet)\n\nThe total estimated gold reserve based on geological work done by the company is 524,611 Ounces.",
  "image1": "/img/excavators-1050501_1280.jpg",
  "image2": "/img/company_1.png",
  "image3": "/img/paddle-wheel-1051962_1280smaller.png"
}